Revit 2026 API

# FabricationPartJustification Enumeration

---

Fabrication part eccentric justifications for alignment for flat edged parts.

**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum FabricationPartJustification
```
```vb
Public Enumeration FabricationPartJustification
```
```cpp
public enum class FabricationPartJustification
```
```fsharp
type FabricationPartJustification
```

| Member name | Value | Description |
| --- | --- | --- |
| Bottom | 1 | Outside edge justification to the bottom |
| Middle | 0 | Default middle justification to the connector |
| Top | 2 | Outside edge justification to the top |

#### Reference

Autodesk.Revit.DB.Fabrication Namespace